base/Catalogs/бит_фн_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_фн_ШаблоныСообщений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_фн_ВидыСобытийОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_фн_СпособыТранспортаОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение_Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение_Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение_Подпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекстаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бейджи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВложений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_фн_ШаблоныСообщений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Список объектов на которые распространяется механизм визирования.
	ВизируемыеОбъекты = бит_ВизированиеСервер.ВизируемыеОбъектыСистемы();

	// Установим доступные типы текстов.
	Элементы.ТипТекстаСообщения.СписокВыбора.Добавить("HTML", НСтр("ru = 'HTML'; en = 'HTML'"));
	Элементы.ТипТекстаСообщения.СписокВыбора.Добавить("ПростойТекст", НСтр("ru = 'Простой текст'; en = 'Plain text'"));
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Типы текста без поддержки.
	Если СтрСравнить(Объект.ТипТекстаСообщения, "ПроизвольныйТекст") = 0 Тогда
		Элементы.ТипТекстаСообщения.СписокВыбора.Добавить("ПроизвольныйТекст", 
			НСтр("ru = '(Не используется) Произвольный текст'; en = 'Not used) Custom text'"));
	ИначеЕсли СтрСравнить(Объект.ТипТекстаСообщения, "РазмеченныйТекст") = 0 Тогда
		Элементы.ТипТекстаСообщения.СписокВыбора.Добавить("РазмеченныйТекст", 
			НСтр("ru = '(Не используется) Размеченный текст'; en = '(Not used) Rich text'"));
	КонецЕсли;
	
	Если СтрСравнить(ТекущийОбъект.ТипТекстаСообщения, "HTML") = 0 И НЕ Объект.РучноеРедактирование Тогда
		Вложения = Справочники.бит_фн_ШаблоныСообщений.ВложенияШаблонаСообщений(ТекущийОбъект.Ссылка);
		Если Вложения = Неопределено Тогда
			Вложения = Новый Структура;
		КонецЕсли;
		ТелоПисьма.УстановитьHTML(ТекущийОбъект.Сообщение_Текст, Вложения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Вложения = Неопределено Тогда
		Вложения = Новый Структура;
	КонецЕсли;
	Если СтрСравнить(Объект.ТипТекстаСообщения, "HTML") = 0 И НЕ Объект.РучноеРедактирование Тогда
		Если Элементы.СтраницыРедактора.ТекущаяСтраница = Элементы.СтраницаТекст Тогда
			ТелоПисьма.УстановитьHTML(ТекущийОбъект.Сообщение_Текст, Вложения);
		Иначе	
			ТелоПисьма.ПолучитьHTML(ТекущийОбъект.Сообщение_Текст, Вложения);
		КонецЕсли;
	КонецЕсли;
	ТекущийОбъект.ХранилищеВложений = Новый ХранилищеЗначения(Вложения, Новый СжатиеДанных(9));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования") Тогда
		СсылкиРМВ = СсылкиРМВ();
		ДанныеВыбора = Новый СписокЗначений();
		ДанныеВыбора.ЗагрузитьЗначения(СсылкиРМВ);
	Иначе	
		СписокВидовОбъектов = Новый СписокЗначений;
		Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ЗаписанСправочник") Тогда
			СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник"));
		ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеПроцесса") Тогда
			СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.БизнесПроцесс"));
		ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеЗадачи") Тогда
			СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Задача"));
		// ++ ЕРП
		ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ПринятоРешение")
			ИЛИ Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.УстановленСтатус") 
			ИЛИ Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ДоступнаВиза") Тогда
			
			СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
			СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник"));
		// -- ЕРП
		Иначе	
			СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   ,Объект.ОбъектСистемы);
		ПараметрыФормы.Вставить("ВидыОбъектов"           ,СписокВидовОбъектов);
		Если НеобходимоОграничитьСписокОбъектов() Тогда
			ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", ВизируемыеОбъекты);	
		КонецЕсли; 
		ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы",ПараметрыФормы,Элемент);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ВидСобытияПриИзменении(Элемент)
	
	// Проверим соответствует ли объект системы виду события.
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ЗаписанСправочник") Тогда
		Если НЕ ВидОбъектаСистемы = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник") Тогда
			Объект.ОбъектСистемы = Неопределено;
		КонецЕсли; 
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеЗадачи") Тогда
		Если НЕ ВидОбъектаСистемы = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Задача") Тогда
			Объект.ОбъектСистемы = Неопределено;
		КонецЕсли;
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеПроцесса") Тогда
		Если НЕ ВидОбъектаСистемы = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.БизнесПроцесс") Тогда
			Объект.ОбъектСистемы = Неопределено;
		КонецЕсли;
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования") Тогда
		Объект.ОбъектСистемы = Неопределено;
	Иначе	
		Если НЕ ВидОбъектаСистемы = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ") Тогда
			Объект.ОбъектСистемы = Неопределено;
		КонецЕсли; 
		// События по визированию и изменению статусов распространяются на ограниченный список документов.
		Если ЗначениеЗаполнено(Объект.ОбъектСистемы) И  НеобходимоОграничитьСписокОбъектов() Тогда
			Если ВизируемыеОбъекты.НайтиПоЗначению(Объект.ОбъектСистемы) = Неопределено Тогда
				Объект.ОбъектСистемы = Неопределено;
			КонецЕсли; 
		КонецЕсли; // Проверка на вхождение в список визируемых.
	КонецЕсли; // По виду события
	
	УстановитьОбъектПоВидуСобытия();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособТранспортаПриИзменении(Элемент)

	СпособТранспортаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СпособТранспортаПриИзмененииНаСервере()
	
	ЭтоПуш = ?(Объект.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.PushNotification, Истина, Ложь);
	ЭтоТелеграм = ?(Объект.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.Telegram, Истина, Ложь);
	Если ЭтоПуш ИЛИ ЭтоТелеграм Тогда
		Объект.ТипТекстаСообщения = "ПростойТекст";
	КонецЕсли; 
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.УстановленСтатус") Тогда
        СтрокаВыбора = НСтр("ru = '%1 объекта ""%2""'");
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ПринятоРешение") Тогда	
		СтрокаВыбора = НСтр("ru = '%1 по визе объекта ""%2""'");		
	Иначе	
		СтрокаВыбора = НСтр("ru = '%1 ""%2""'");
	КонецЕсли; 
	СтрокаВыбора = СтрШаблон(СтрокаВыбора, Объект.ВидСобытия, Объект.ОбъектСистемы);
	Элемент.СписокВыбора.Добавить(СтрокаВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.УстановленСтатус") Тогда
		СтрВыбора = НСтр("ru = '%1 объекта ""%2""'; en = '%1 object ""%2""'");
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ПринятоРешение") Тогда	
		СтрВыбора = НСтр("ru = '%1 по визе объекта ""%2""'; en = '%1 by object visa ""%2""'");
	Иначе	
		СтрВыбора = НСтр("ru = '%1 ""%2""'; en = '%1 ""%2""'");		
	КонецЕсли; 
	СтрВыбора = СтрШаблон(СтрВыбора, Объект.ВидСобытия, Объект.ОбъектСистемы);
	Элемент.СписокВыбора.Добавить(СтрВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура БейджиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("Число") , НСтр("ru='Число бейждей';en='Number beyzhdey'"));
	СписокТипов.Добавить(Тип("Строка"), НСтр("ru='Выражение';en='Expression'"));
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект, 
		Элемент, Объект, "Бейджи", СписокТипов, СтандартнаяОбработка);
		
	Элементы.Бейджи.КнопкаВыпадающегоСписка = ТипЗнч(Объект.Бейджи) = Тип("Строка");		
		
КонецПроцедуры

&НаКлиенте
Процедура БейджиОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура БейджиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.Бейджи) = Тип("Строка") И Ожидание = 0 Тогда
		 СтандартнаяОбработка = Ложь;
		 ДанныеВыбора = Новый СписокЗначений;
		 ДанныеВыбора.Добавить("СтруктураКонтекст.ВыборкаДокументов.Количество()");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТекстаСообщенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если СтрСравнить(Объект.ТипТекстаСообщения, "ПроизвольныйТекст") = 0
		ИЛИ СтрСравнить(Объект.ТипТекстаСообщения, "РазмеченныйТекст") = 0 Тогда
		
		Пояснение = НСтр("ru='Выбранный тип текста сообщения не поддерживается.';
						|en='The selected message text type is not supported.'");
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "КОРРЕКТНОСТЬ",
							НСтр("ru = 'Тип текста сообщения'; en = 'Message Text Type'"),,, Пояснение);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ТипТекстаСообщения", "Объект");
		Возврат;
	КонецЕсли;
	
	УказанныйТипТекстаСообщения = ВыбранноеЗначение; 
	Если ВыбранноеЗначение <> Объект.ТипТекстаСообщения Тогда
			СтандартнаяОбработка = Ложь;
			Оповещение = Новый ОписаниеОповещения("ТипТекстаВопросЗавершение", ЭтотОбъект, УказанныйТипТекстаСообщения); 
			ТекстВопроса = НСтр("ru='Текст письма будет очищен. Продолжить?';
				|en='The text of the letter will be cleared. Proceed?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик оповещения "ТипТекстаВопросЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ТипТекстаВопросЗавершение(Ответ, УказанныйТипТекстаСообщения) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ТипТекстаСообщения = УказанныйТипТекстаСообщения;
		Объект.Сообщение_Текст = "";
		ТелоПисьма.Удалить();
		Модифицированность = Истина;
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВставитьШаблон(Команда)
	
	ПараметрыФормы = Новый Структура;
  	ПараметрыФормы.Вставить("ВидСобытия"   , Объект.ВидСобытия);
    ПараметрыФормы.Вставить("ОбъектСистемы", Объект.ОбъектСистемы);
	Обработчик = Новый ОписаниеОповещения("ВставитьШаблонЗавершение", ЭтотОбъект);
    Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
    ОткрытьФорму("Справочник.бит_фн_ШаблоныСообщений.Форма.ФормаШаблона",ПараметрыФормы,,,,, Обработчик, Режим);
	
КонецПроцедуры

// Процедура обработчик оповещения "ВставитьШаблонЗавершение".
// 
// Параметры:
// СтрокаРезультат - Строка
// Параметры - Структура
// 
&НаКлиенте
Процедура ВставитьШаблонЗавершение(СтрокаРезультат, Параметры) Экспорт

	Если Лев(ТекущийЭлемент.Имя, 10) = "Сообщение_"
		ИЛИ СтрСравнить(ТекущийЭлемент.Имя, "ТелоПисьма") = 0  Тогда
		
		Если СтрСравнить(ТекущийЭлемент.Имя, "ТелоПисьма") = 0 Тогда
			
			ЗакладкаНачала		= Неопределено;
			ЗакладкаОкончания	= Неопределено;
			ТекущийЭлемент.ПолучитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);
			
			Если ЗакладкаНачала <> ЗакладкаОкончания Тогда 
				ТелоПисьма.Удалить(ЗакладкаНачала, ЗакладкаОкончания);
				ТекущийЭлемент.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаНачала);
			КонецЕсли;
			
			Если ТелоПисьма.Элементы.Количество() = 0 Тогда
				НовыйЭлементДокумента = ТелоПисьма.Добавить(СтрокаРезультат, Тип("ТекстФорматированногоДокумента"));
			Иначе
				НовыйЭлементДокумента = ТелоПисьма.Вставить(ЗакладкаНачала, СтрокаРезультат, Тип("ТекстФорматированногоДокумента"));
			КонецЕсли;
			
		Иначе	
			ТекущийЭлемент.ВыделенныйТекст = СтрокаРезультат;
		КонецЕсли;
		ЭтотОбъект.ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПоУмолчанию(Команда)
	
	ЗаполнитьШаблонПоУмолчанию();
	
КонецПроцедуры

// Процедура заполняет шаблон сообщения по умолчанию. 
// 
// Параметры:
// 
&НаСервере
Процедура ЗаполнитьШаблонПоУмолчанию()

	Если Объект.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта
		// ++ ЕРП
		ИЛИ Объект.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.СистемаВзаимодействия
		// -- ЕРП
		ИЛИ Объект.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта1С Тогда
		
		Если Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ОкончаниеСрокаДействияДоговора Тогда
			МакетПоУмолчанию = Справочники.бит_фн_ШаблоныСообщений.ПолучитьМакет("ШаблонПоУмолчаниюСрокДействия");
		ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования Тогда
			МакетПоУмолчанию = Справочники.бит_фн_ШаблоныСообщений.ПолучитьМакет("ШаблонПоУмолчаниюВизирование");
		// ++ ЕРП
		ИначеЕсли ЭтоШаблонЗаявкиНаРасходованиеДС() Тогда
			МакетПоУмолчанию = Справочники.бит_фн_ШаблоныСообщений.ПолучитьМакет("ШаблонПоУмолчаниюПлатежныеПозиции");
		// -- ЕРП
		Иначе
			МакетПоУмолчанию = Справочники.бит_фн_ШаблоныСообщений.ПолучитьМакет("ШаблонПоУмолчанию");
		КонецЕсли;
		Объект.Сообщение_Текст = МакетПоУмолчанию.ПолучитьТекст();
		Объект.ТипТекстаСообщения = ТипТекстаПочтовогоСообщения.HTML;
	ИначеЕсли Объект.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.PushNotification Тогда	
		Если Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования Тогда
			// АПК:1297-выкл Строковый параметр. 
			Объект.Бейджи = "СтруктураКонтекст.ВыборкаДокументов.Количество()";
			Объект.Сообщение_Заголовок = "{%СтруктураКонтекст.ВыборкаДокументов.Количество()%} документов для визирования";
			Объект.Сообщение_Текст = "Доступно {%СтруктураКонтекст.ВыборкаДокументов.Количество()%} документов для визирования.";
			// АПК:1297-вкл Строковый параметр. 
		КонецЕсли; 
		Объект.ТипТекстаСообщения = ТипТекстаПочтовогоСообщения.ПростойТекст;
	КонецЕсли; 
	
	Если СтрСравнить(Объект.ТипТекстаСообщения, "HTML") = 0 И НЕ Объект.РучноеРедактирование Тогда
		ВложенияДляПисьма = Новый Структура;
		ТелоПисьма.УстановитьHTML(Объект.Сообщение_Текст, ВложенияДляПисьма);
	КонецЕсли;
	УстановитьВидимость();
		
КонецПроцедуры

&НаКлиенте
Процедура РучноеРедактирование(Команда)
	
	Оповещение = Новый ОписаниеОповещения("РучноеРедактированиеЗавершение", ЭтотОбъект); 
	ТекстВопроса = НСтр("ru='Текст письма будет очищен. Продолжить?';
						|en='The text of the letter will be cleared. Proceed?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

// Процедура обработчик оповещения "РучноеРедактированиеЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура РучноеРедактированиеЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.РучноеРедактирование = НЕ Объект.РучноеРедактирование;
		Объект.Сообщение_Текст = "";
		ТелоПисьма.Удалить();
		Вложение = Неопределено;
		Модифицированность = Истина;
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()
	
	ЭтоДокументыДляВизирования = ?(Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования,Истина,Ложь);
	ЭтоПуш = ?(Объект.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.PushNotification, Истина, Ложь);
	ЭтоТелеграм = ?(Объект.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.Telegram, Истина, Ложь);

	Если (Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуНачислений 
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуПлатежей 
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ОкончаниеСрокаДействияДоговора 
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования 
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования
		// ++ ЕРП
		ИЛИ ЭтоШаблонЗаявкиНаРасходованиеДС()
		// -- ЕРП
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияОбОплате) 
		И ЗначениеЗаполнено(Объект.СпособТранспорта) Тогда
		
		Элементы.ФормаШаблонПоУмолчанию.Доступность = Истина;
	Иначе
		Элементы.ФормаШаблонПоУмолчанию.Доступность = Ложь;
	КонецЕсли;
	Элементы.Сообщение_Подпись.Видимость = НЕ ЭтоПуш И НЕ ЭтоТелеграм;
	Элементы.ТипТекстаСообщения.Доступность = НЕ ЭтоПуш И НЕ ЭтоТелеграм;
	Элементы.Бейджи.Видимость = ЭтоПуш;
	Если Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияОбОплате Тогда
		Элементы.ОбъектСистемы.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ОбъектСистемы.ТолькоПросмотр = Ложь;
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	Если СтрСравнить(Объект.ТипТекстаСообщения, "HTML") = 0 И НЕ Объект.РучноеРедактирование Тогда
		Элементы.СтраницаРедактирование.Видимость = Истина;
		Элементы.СтраницаТекст.Видимость = Ложь;
	ИначеЕсли СтрСравнить(Объект.ТипТекстаСообщения, "ПростойТекст") = 0 Тогда
		Элементы.СтраницаРедактирование.Видимость = Ложь;
		Элементы.ГруппаПросмотр.Видимость = Ложь;
		Элементы.СтраницаТекст.Видимость = Истина;
		Элементы.ГрафическийРедактор.Видимость = Ложь;
	ИначеЕсли СтрСравнить(Объект.ТипТекстаСообщения, "HTML") = 0 И Объект.РучноеРедактирование Тогда
		Элементы.СтраницаРедактирование.Видимость = Ложь;
		Элементы.ГруппаПросмотр.Видимость = Истина;
		Элементы.СтраницаТекст.Видимость = Истина;
		Элементы.ГрафическийРедактор.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура заполняет реквизит ОбъектСистемы некоторым значением по-умолчания для текущего вида события.
// 
&НаСервере
Процедура УстановитьОбъектПоВидуСобытия()
	
	Если Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования Тогда
		МетаОбъект = Метаданные.Обработки.бит_КонсольОперативногоВизирования;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
	ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеПроцесса Тогда
		МетаОбъект = Метаданные.БизнесПроцессы.бит_Процесс;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
	ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеЗадачи Тогда
		МетаОбъект = Метаданные.Задачи.бит_Задача;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
	ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияОбОплате Тогда
		МетаОбъект = Метаданные.Документы.бит_кзн_ПлатежнаяПозиция;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимоОграничитьСписокОбъектов()

	Результат = Ложь;
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ПринятоРешение") 
		ИЛИ Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.УстановленСтатус") 
		ИЛИ Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ДоступнаВиза") Тогда		
		Результат = Истина;	
	КонецЕсли; 	

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкиРМВ()
	
	Результат = Новый Массив();
	Результат.Добавить(бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Обработки.бит_КонсольОперативногоВизирования));
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция ЭтоШаблонЗаявкиНаРасходованиеДС()
	
	// ++ ЕРП
	Результат = Ложь;
	МетаОбъект = Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств;
	ЗаявкаНаРасходованиеДС = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
	
	Если Объект.ОбъектСистемы = ЗаявкаНаРасходованиеДС 
		И (Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДоступнаВиза
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ЗаписанДокумент
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ПринятоРешение
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ПроведенДокумент
		ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.УстановленСтатус) Тогда
		
		Результат = Истина;	
	КонецЕсли;
	
	Возврат Результат;
	// -- ЕРП
	
КонецФункции

#КонецОбласти
